Revit 2024 API
ParameterTypeId.ElecticalEquipWattage Property
 "Wattage"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ElecticalEquipWattage { get; }
Visual Basic
Public Shared ReadOnly Property ElecticalEquipWattage As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElecticalEquipWattage {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace